chat_system_118292948_actor_description=Frogus Squelch. Mutant Frogmen.
chat_system_118292948_snap_7_question=^?^Croak! Hi, [player]. How is life outside of the swamp?
chat_system_118292948_snap_7_answer_0=^?^All is well. However, I often long to return to your fine swamplands.
chat_system_118292948_snap_8_question=^?^Yeees! Our swampland is a distinguished one. Well... come by if you ever need something.
chat_system_118292948_snap_8_answer_0=^?^Make no doubt. Your family is the first thing I'll think of.
chat_system_118292948_snap_0_question=^?^Croak! I have guests, have I not? I salute you, traveler. How did you come so far and not disappear in the bog?
chat_system_118292948_snap_0_answer_0=^?^Good day to you too, my good... eh... man?
chat_system_118292948_switch_1_header_0=^?^Me? Man? Ho-croak-ho-croak-ho! I am not a man, I am a frogman! And my name is Squelch. I am the owner of the Brown Hlezn castle. And who are you?
chat_system_118292948_snap_4_question=^?^1
chat_system_118292948_snap_4_answer_0=^?^I am [player], the Treasure Searcher of His Majesty, King Mark! Listen, I have already met someone who looks like you... you aren't brothers by chance, are you?
chat_system_118292948_snap_2_question=^?^Someone who looks like me? You probably mean Bagaba. Yes, we are siblings. Actually I have two brothers: Bagaba and Bogis. We were born by a girl-frog, who was turned into a princess. I am the eldest, then comes Bagaba and Bogis is the youngest.
chat_system_118292948_snap_2_answer_0=^?^Very interesting... very interesting indeed. So, princess-frogs give birth to... frogmen?
chat_system_118292948_snap_3_question=^?^It is as you say. We children of frogs are special - we are unusually developed. By human standards we are just children. I am the eldest, I am ten, Bagaba is eight and Bogis is only five years old.<br>Hmm. Look, human, can you help me, eh?
chat_system_118292948_snap_3_answer_0=^?^It depends on what you ask.
chat_system_118292948_snap_5_question=^?^1
chat_system_118292948_snap_5_answer_0=^?^I am [player], the Treasure Searcher of His Majesty, King Mark.
chat_system_118292948_snap_1_question=^?^Look, [player], have you met anybody in these parts who looks like me? 
chat_system_118292948_snap_1_answer_0=^?^What? There is someone else who looks like you? It is true that the world is full of wonders.
chat_system_118292948_snap_6_question=^?^Oh, yes! I have two brothers: Bagaba and Bogis. We were born by a girl-frog who was turned into a princess. I am the eldest, then comes Bagaba and Bogis is the youngest.
chat_system_118292948_snap_6_answer_0=^?^Very interesting... very interesting indeed. So, princess-frogs give birth to... frogmen?
chat_system_118292948_snap_9_question=^?^What brings you to my castle again, knight?
chat_system_118292948_snap_9_answer_0=^?^You said that you need some help?
chat_system_118292948_snap_9_answer_1=^?^Just came to see how you're doing. I'll be on my way. 
